[Killed] BooleanLiteral
src/index.ts:86:34
  */
 class JsonDiagLogger implements DiagLogger {
     loggerOptions: LoggerOptions
-    firstIncomingRequestLogged = false
+    firstIncomingRequestLogged = true
 
     /**
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] BlockStatement
src/index.ts:92:41
      * Creates a new instance of Logger.
      * @param {LoggerOptions} options - The logger options to be used
      */
-    constructor(options: LoggerOptions) {
-        this.loggerOptions = options
-    }
+    constructor(options: LoggerOptions) {}
 
     /**
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and undefined
statusReason: Cannot destructure property 'truncateLimit' of 'this.loggerOptions' as it is undefined.

[Killed] BlockStatement
src/index.ts:100:46
      * Sets the loggerOptions to the provided values
      * @param {LoggerOptions} options - The logger options to be used
      */
-    setOptions(options: LoggerOptions): void {
-        this.loggerOptions = options
-    }
+    setOptions(options: LoggerOptions): void {}
 
     debug(message: string, ...arguments_: unknown[]): void {
killedBy: Logger writes expected output to command line Test Service Request error message logging
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] LogicalOperator
src/index.ts:106:13
 
     debug(message: string, ...arguments_: unknown[]): void {
         if (
-            this.loggerOptions.logLevelForRegisterGlobalMessages &&
-            message.includes('Registered a global')
+            this.loggerOptions.logLevelForRegisterGlobalMessages || message.includes('Registered a global')
         ) {
             this.logMessage({
killedBy: Logger writes expected output to command line Test logging registered global message on info level
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] ConditionalExpression
src/index.ts:106:13
 
     debug(message: string, ...arguments_: unknown[]): void {
         if (
-            this.loggerOptions.logLevelForRegisterGlobalMessages &&
-            message.includes('Registered a global')
+            false
         ) {
             this.logMessage({
killedBy: Logger writes expected output to command line Test logging registered global message on info level
statusReason: expected 1st "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:108:11
         if (
             this.loggerOptions.logLevelForRegisterGlobalMessages &&
             message.includes('Registered a global')
-        ) {
-            this.logMessage({
-                logArguments: arguments_,
-                loglevel: this.loggerOptions.logLevelForRegisterGlobalMessages,
-                message,
-            })
-        } else if (this.loggerOptions.logFirstIncomingRequest) {
+        ) {} else if (this.loggerOptions.logFirstIncomingRequest) {
             if (
                 !this.firstIncomingRequestLogged &&
killedBy: Logger writes expected output to command line Test logging registered global message on info level
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] ObjectLiteral
src/index.ts:109:29
             this.loggerOptions.logLevelForRegisterGlobalMessages &&
             message.includes('Registered a global')
         ) {
-            this.logMessage({
-                logArguments: arguments_,
-                loglevel: this.loggerOptions.logLevelForRegisterGlobalMessages,
-                message,
-            })
+            this.logMessage({})
         } else if (this.loggerOptions.logFirstIncomingRequest) {
             if (
killedBy: Logger writes expected output to command line Test logging registered global message on info level
statusReason: expected 1st "log" call to have been called with [ Array(1) ]

[Killed] ConditionalExpression
src/index.ts:114:20
                 loglevel: this.loggerOptions.logLevelForRegisterGlobalMessages,
                 message,
             })
-        } else if (this.loggerOptions.logFirstIncomingRequest) {
+        } else if (false) {
             if (
                 !this.firstIncomingRequestLogged &&
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected "log" to be called +0 times, but got 1 times

[Killed] ConditionalExpression
src/index.ts:114:20
                 loglevel: this.loggerOptions.logLevelForRegisterGlobalMessages,
                 message,
             })
-        } else if (this.loggerOptions.logFirstIncomingRequest) {
+        } else if (true) {
             if (
                 !this.firstIncomingRequestLogged &&
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] LogicalOperator
src/index.ts:116:17
             })
         } else if (this.loggerOptions.logFirstIncomingRequest) {
             if (
-                !this.firstIncomingRequestLogged &&
-                this.isIncomingRequestLogMessage(arguments_)
+                !this.firstIncomingRequestLogged || this.isIncomingRequestLogMessage(arguments_)
             ) {
                 this.logMessage({
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected "log" to be called +0 times, but got 1 times

[Killed] ConditionalExpression
src/index.ts:116:17
             })
         } else if (this.loggerOptions.logFirstIncomingRequest) {
             if (
-                !this.firstIncomingRequestLogged &&
-                this.isIncomingRequestLogMessage(arguments_)
+                true
             ) {
                 this.logMessage({
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected "log" to be called +0 times, but got 1 times

[Killed] BlockStatement
src/index.ts:118:15
             if (
                 !this.firstIncomingRequestLogged &&
                 this.isIncomingRequestLogMessage(arguments_)
-            ) {
-                this.logMessage({
-                    logArguments: [],
-                    loglevel: 'INFO',
-                    message: 'First incoming request',
-                })
-                this.firstIncomingRequestLogged = true
-            } else if (
+            ) {} else if (
                 this.loggerOptions.minLogLevel &&
                 this.isEqualOrHigherMinLogLevel(
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] StringLiteral
src/index.ts:122:30
                 this.logMessage({
                     logArguments: [],
                     loglevel: 'INFO',
-                    message: 'First incoming request',
+                    message: "",
                 })
                 this.firstIncomingRequestLogged = true
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected 1st "log" call to have been called with [ Array(1) ]

[Killed] BooleanLiteral
src/index.ts:124:51
                     loglevel: 'INFO',
                     message: 'First incoming request',
                 })
-                this.firstIncomingRequestLogged = true
+                this.firstIncomingRequestLogged = false
             } else if (
                 this.loggerOptions.minLogLevel &&
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected "log" to be called 1 times, but got 2 times

[Killed] LogicalOperator
src/index.ts:126:17
                 })
                 this.firstIncomingRequestLogged = true
             } else if (
-                this.loggerOptions.minLogLevel &&
-                this.isEqualOrHigherMinLogLevel(
-                    this.loggerOptions.minLogLevel,
-                ) &&
+                this.loggerOptions.minLogLevel || this.isEqualOrHigherMinLogLevel(this.loggerOptions.minLogLevel) &&
                 !this.isIncomingRequestLogMessage(arguments_)
             ) {
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected "log" to be called +0 times, but got 1 times

[Killed] ConditionalExpression
src/index.ts:126:17
                 })
                 this.firstIncomingRequestLogged = true
             } else if (
-                this.loggerOptions.minLogLevel &&
-                this.isEqualOrHigherMinLogLevel(
-                    this.loggerOptions.minLogLevel,
-                ) &&
-                !this.isIncomingRequestLogMessage(arguments_)
+                true
             ) {
                 this.logMessage({
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected "log" to be called +0 times, but got 1 times

[Killed] BooleanLiteral
src/index.ts:130:17
                 this.isEqualOrHigherMinLogLevel(
                     this.loggerOptions.minLogLevel,
                 ) &&
-                !this.isIncomingRequestLogMessage(arguments_)
+                this.isIncomingRequestLogMessage(arguments_)
             ) {
                 this.logMessage({
killedBy: Logger writes expected output to command line Test logging only first incoming message and other debug messages if minLogLevel is  debug or higher
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] BlockStatement
src/index.ts:131:15
                     this.loggerOptions.minLogLevel,
                 ) &&
                 !this.isIncomingRequestLogMessage(arguments_)
-            ) {
-                this.logMessage({
-                    logArguments: arguments_,
-                    loglevel: 'DEBUG',
-                    message,
-                })
-            }
+            ) {}
         } else {
             this.logMessage({
killedBy: Logger writes expected output to command line Test logging only first incoming message and other debug messages if minLogLevel is  debug or higher
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] BlockStatement
src/index.ts:138:16
                     message,
                 })
             }
-        } else {
-            this.logMessage({
-                logArguments: arguments_,
-                loglevel: 'DEBUG',
-                message,
-            })
-        }
+        } else {}
     }
 
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] ConditionalExpression
src/index.ts:150:13
     error(message: string, ...arguments_: unknown[]): void {
         let logLevel: LogLevel
         if (
-            this.loggerOptions.logLevelForServiceRequestErrorMessages &&
-            message === 'Service request'
+            false
         ) {
             logLevel = this.loggerOptions.logLevelForServiceRequestErrorMessages
killedBy: Logger writes expected output to command line Test Service Request error message logging
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] LogicalOperator
src/index.ts:150:13
     error(message: string, ...arguments_: unknown[]): void {
         let logLevel: LogLevel
         if (
-            this.loggerOptions.logLevelForServiceRequestErrorMessages &&
-            message === 'Service request'
+            this.loggerOptions.logLevelForServiceRequestErrorMessages || message === 'Service request'
         ) {
             logLevel = this.loggerOptions.logLevelForServiceRequestErrorMessages
killedBy: Logger writes expected output to command line Test Service Request error message logging
statusReason: expected 1st "log" call to have been called with [ Array(1) ]

[Killed] ConditionalExpression
src/index.ts:151:13
         let logLevel: LogLevel
         if (
             this.loggerOptions.logLevelForServiceRequestErrorMessages &&
-            message === 'Service request'
+            true
         ) {
             logLevel = this.loggerOptions.logLevelForServiceRequestErrorMessages
killedBy: Logger writes expected output to command line Test Service Request error message logging
statusReason: expected 3rd "log" call to have been called with [ Array(1) ]

[Killed] EqualityOperator
src/index.ts:151:13
         let logLevel: LogLevel
         if (
             this.loggerOptions.logLevelForServiceRequestErrorMessages &&
-            message === 'Service request'
+            message !== 'Service request'
         ) {
             logLevel = this.loggerOptions.logLevelForServiceRequestErrorMessages
killedBy: Logger writes expected output to command line Test Service Request error message logging
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:152:11
         if (
             this.loggerOptions.logLevelForServiceRequestErrorMessages &&
             message === 'Service request'
-        ) {
-            logLevel = this.loggerOptions.logLevelForServiceRequestErrorMessages
-        } else if (
+        ) {} else if (
             this.loggerOptions.logLevelForTimeoutErrorMessages &&
             this.containsTimeout(message)
killedBy: Logger writes expected output to command line Test Service Request error message logging
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] ConditionalExpression
src/index.ts:155:13
         ) {
             logLevel = this.loggerOptions.logLevelForServiceRequestErrorMessages
         } else if (
-            this.loggerOptions.logLevelForTimeoutErrorMessages &&
-            this.containsTimeout(message)
+            false
         ) {
             logLevel = this.loggerOptions.logLevelForTimeoutErrorMessages
killedBy: Logger writes expected output to command line Test Timeout error message logging for message containing "14 UNAVAILABLE"
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] LogicalOperator
src/index.ts:155:13
         ) {
             logLevel = this.loggerOptions.logLevelForServiceRequestErrorMessages
         } else if (
-            this.loggerOptions.logLevelForTimeoutErrorMessages &&
-            this.containsTimeout(message)
+            this.loggerOptions.logLevelForTimeoutErrorMessages || this.containsTimeout(message)
         ) {
             logLevel = this.loggerOptions.logLevelForTimeoutErrorMessages
killedBy: Logger writes expected output to command line Test Timeout error message logging for message containing "14 UNAVAILABLE"
statusReason: expected 1st "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:157:11
         } else if (
             this.loggerOptions.logLevelForTimeoutErrorMessages &&
             this.containsTimeout(message)
-        ) {
-            logLevel = this.loggerOptions.logLevelForTimeoutErrorMessages
-        } else if (
+        ) {} else if (
             this.loggerOptions.logLevelForAsyncAttributeError &&
             this.containsAsyncAttributeError(message)
killedBy: Logger writes expected output to command line Test Timeout error message logging for message containing "14 UNAVAILABLE"
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] ConditionalExpression
src/index.ts:160:13
         ) {
             logLevel = this.loggerOptions.logLevelForTimeoutErrorMessages
         } else if (
-            this.loggerOptions.logLevelForAsyncAttributeError &&
-            this.containsAsyncAttributeError(message)
+            true
         ) {
             logLevel = this.loggerOptions.logLevelForAsyncAttributeError
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 4th "log" call to have been called with [ Array(1) ]

[Killed] LogicalOperator
src/index.ts:160:13
         ) {
             logLevel = this.loggerOptions.logLevelForTimeoutErrorMessages
         } else if (
-            this.loggerOptions.logLevelForAsyncAttributeError &&
-            this.containsAsyncAttributeError(message)
+            this.loggerOptions.logLevelForAsyncAttributeError || this.containsAsyncAttributeError(message)
         ) {
             logLevel = this.loggerOptions.logLevelForAsyncAttributeError
killedBy: Logger writes expected output to command line Test async attribute error message logging
statusReason: expected 1st "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:162:11
         } else if (
             this.loggerOptions.logLevelForAsyncAttributeError &&
             this.containsAsyncAttributeError(message)
-        ) {
-            logLevel = this.loggerOptions.logLevelForAsyncAttributeError
-        } else {
+        ) {} else {
             logLevel = 'ERROR'
         }
killedBy: Logger writes expected output to command line Test async attribute error message logging
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:164:16
             this.containsAsyncAttributeError(message)
         ) {
             logLevel = this.loggerOptions.logLevelForAsyncAttributeError
-        } else {
-            logLevel = 'ERROR'
-        }
+        } else {}
 
         this.logMessage({
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 4th "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:175:59
         })
     }
 
-    info(message: string, ...arguments_: unknown[]): void {
-        this.logMessage({
-            logArguments: arguments_,
-            loglevel: 'INFO',
-            message,
-        })
-    }
+    info(message: string, ...arguments_: unknown[]): void {}
 
     verbose(message: string, ...arguments_: unknown[]): void {
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 3rd "log" call to have been called with [ Array(1) ], but called only 2 times

[Killed] BlockStatement
src/index.ts:183:62
         })
     }
 
-    verbose(message: string, ...arguments_: unknown[]): void {
-        this.logMessage({
-            logArguments: arguments_,
-            loglevel: this.loggerOptions.logLevelForVerbose ?? 'VERBOSE',
-            message,
-        })
-    }
+    verbose(message: string, ...arguments_: unknown[]): void {}
 
     warn(message: string, ...arguments_: unknown[]): void {
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 2nd "log" call to have been called with [ Array(1) ], but called only 1 times

[Killed] ObjectLiteral
src/index.ts:184:25
     }
 
     verbose(message: string, ...arguments_: unknown[]): void {
-        this.logMessage({
-            logArguments: arguments_,
-            loglevel: this.loggerOptions.logLevelForVerbose ?? 'VERBOSE',
-            message,
-        })
+        this.logMessage({})
     }
 
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] LogicalOperator
src/index.ts:186:23
     verbose(message: string, ...arguments_: unknown[]): void {
         this.logMessage({
             logArguments: arguments_,
-            loglevel: this.loggerOptions.logLevelForVerbose ?? 'VERBOSE',
+            loglevel: this.loggerOptions.logLevelForVerbose && 'VERBOSE',
             message,
         })
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:191:59
         })
     }
 
-    warn(message: string, ...arguments_: unknown[]): void {
-        this.logMessage({
-            logArguments: arguments_,
-            loglevel: 'WARN',
-            message,
-        })
-    }
+    warn(message: string, ...arguments_: unknown[]): void {}
 
     logMessage(logEntryInput: LogEntryInput): void {
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 5th "log" call to have been called with [ Array(1) ], but called only 4 times

[Killed] BlockStatement
src/index.ts:199:52
         })
     }
 
-    logMessage(logEntryInput: LogEntryInput): void {
-        if (
-            logEntryInput.loglevel !== 'OFF' &&
-            this.isEqualOrHigherMinLogLevel(logEntryInput.loglevel)
-        ) {
-            loggerConsole.log(
-                JSON.stringify(this.createLogEntry(logEntryInput)),
-            )
-        }
-    }
+    logMessage(logEntryInput: LogEntryInput): void {}
 
     createLogEntry(logEntryInput: LogEntryInput): LogEntry {
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] LogicalOperator
src/index.ts:201:13
 
     logMessage(logEntryInput: LogEntryInput): void {
         if (
-            logEntryInput.loglevel !== 'OFF' &&
-            this.isEqualOrHigherMinLogLevel(logEntryInput.loglevel)
+            logEntryInput.loglevel !== 'OFF' || this.isEqualOrHigherMinLogLevel(logEntryInput.loglevel)
         ) {
             loggerConsole.log(
killedBy: Logger writes expected output to command line Test downgrading and ignoring verbose message
statusReason: expected "log" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/index.ts:201:13
 
     logMessage(logEntryInput: LogEntryInput): void {
         if (
-            logEntryInput.loglevel !== 'OFF' &&
-            this.isEqualOrHigherMinLogLevel(logEntryInput.loglevel)
+            false
         ) {
             loggerConsole.log(
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] BlockStatement
src/index.ts:203:11
         if (
             logEntryInput.loglevel !== 'OFF' &&
             this.isEqualOrHigherMinLogLevel(logEntryInput.loglevel)
-        ) {
-            loggerConsole.log(
-                JSON.stringify(this.createLogEntry(logEntryInput)),
-            )
-        }
+        ) {}
     }
 
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] LogicalOperator
src/index.ts:219:36
         let logMessage =
             this.formatMessage(message) +
             `. Log arguments are: ${inspect(logArguments, { depth: 20 })}`
-        const truncatedTextToUse = truncatedText ?? '_TRUNCATED_'
+        const truncatedTextToUse = truncatedText && '_TRUNCATED_'
         if (
             truncateLimit &&
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/index.ts:219:53
         let logMessage =
             this.formatMessage(message) +
             `. Log arguments are: ${inspect(logArguments, { depth: 20 })}`
-        const truncatedTextToUse = truncatedText ?? '_TRUNCATED_'
+        const truncatedTextToUse = truncatedText ?? ""
         if (
             truncateLimit &&
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '\'{"stack":"Error: 14' to be '\'{"stack"_TRUNCATED_' // Object.is equality

[Killed] LogicalOperator
src/index.ts:221:13
             `. Log arguments are: ${inspect(logArguments, { depth: 20 })}`
         const truncatedTextToUse = truncatedText ?? '_TRUNCATED_'
         if (
-            truncateLimit &&
-            // Stryker disable next-line all - Does not matters
-            truncateLimit > 0 &&
+            truncateLimit ||
+// Stryker disable next-line all - Does not matters
+truncateLimit > 0 &&
             logMessage.length > truncateLimit + truncatedTextToUse.length
         ) {
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and -2
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABLE: No…' to be '\'{"stack":"Error: 14 UNAVAILABLE: No…' // Object.is equality

[Killed] LogicalOperator
src/index.ts:221:13
             `. Log arguments are: ${inspect(logArguments, { depth: 20 })}`
         const truncatedTextToUse = truncatedText ?? '_TRUNCATED_'
         if (
-            truncateLimit &&
-            // Stryker disable next-line all - Does not matters
-            truncateLimit > 0 &&
-            logMessage.length > truncateLimit + truncatedTextToUse.length
+            truncateLimit &&
+// Stryker disable next-line all - Does not matters
+truncateLimit > 0 || logMessage.length > truncateLimit + truncatedTextToUse.length
         ) {
             logMessage =
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 2000
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABLE: No…' to be '\'{"stack":"Error: 14 UNAVAILABLE: No…' // Object.is equality

[Killed] EqualityOperator
src/index.ts:224:13
             truncateLimit &&
             // Stryker disable next-line all - Does not matters
             truncateLimit > 0 &&
-            logMessage.length > truncateLimit + truncatedTextToUse.length
+            logMessage.length <= truncateLimit + truncatedTextToUse.length
         ) {
             logMessage =
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABLE: No…' to be '\'{"stack"_TRUNCATED_' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:224:13
             truncateLimit &&
             // Stryker disable next-line all - Does not matters
             truncateLimit > 0 &&
-            logMessage.length > truncateLimit + truncatedTextToUse.length
+            true
         ) {
             logMessage =
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 2000
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABLE: No…' to be '\'{"stack":"Error: 14 UNAVAILABLE: No…' // Object.is equality

[Killed] BlockStatement
src/index.ts:225:11
             // Stryker disable next-line all - Does not matters
             truncateLimit > 0 &&
             logMessage.length > truncateLimit + truncatedTextToUse.length
-        ) {
-            logMessage =
-                truncateLimit > truncatedTextToUse.length
-                    ? logMessage.slice(
-                          0,
-                          truncateLimit - truncatedTextToUse.length,
-                      ) + truncatedTextToUse
-                    : logMessage.slice(0, truncateLimit)
-        }
+        ) {}
 
         return {
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABLE: No…' to be '\'{"stack"_TRUNCATED_' // Object.is equality

[Killed] EqualityOperator
src/index.ts:227:17
             logMessage.length > truncateLimit + truncatedTextToUse.length
         ) {
             logMessage =
-                truncateLimit > truncatedTextToUse.length
+                truncateLimit <= truncatedTextToUse.length
                     ? logMessage.slice(
                           0,
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '\'{"stack":"Error: 14' to be '\'{"stack"_TRUNCATED_' // Object.is equality

[Killed] EqualityOperator
src/index.ts:227:17
             logMessage.length > truncateLimit + truncatedTextToUse.length
         ) {
             logMessage =
-                truncateLimit > truncatedTextToUse.length
+                truncateLimit >= truncatedTextToUse.length
                     ? logMessage.slice(
                           0,
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , '_TRUNC_' and 7
statusReason: expected '_TRUNC_' to be '\'{"stac' // Object.is equality
