[Killed] MethodExpression
src/index.ts:228:23
         ) {
             logMessage =
                 truncateLimit > truncatedTextToUse.length
-                    ? logMessage.slice(
-                          0,
-                          truncateLimit - truncatedTextToUse.length,
-                      ) + truncatedTextToUse
+                    ? logMessage + truncatedTextToUse
                     : logMessage.slice(0, truncateLimit)
         }
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABLE: No…' to be '\'{"stack"_TRUNCATED_' // Object.is equality

[Killed] ArithmeticOperator
src/index.ts:228:23
         ) {
             logMessage =
                 truncateLimit > truncatedTextToUse.length
-                    ? logMessage.slice(
-                          0,
-                          truncateLimit - truncatedTextToUse.length,
-                      ) + truncatedTextToUse
+                    ? logMessage.slice(0, truncateLimit - truncatedTextToUse.length) - truncatedTextToUse
                     : logMessage.slice(0, truncateLimit)
         }
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected NaN to be '\'{"stack"_TRUNCATED_' // Object.is equality

[Killed] ArithmeticOperator
src/index.ts:230:27
                 truncateLimit > truncatedTextToUse.length
                     ? logMessage.slice(
                           0,
-                          truncateLimit - truncatedTextToUse.length,
+                          truncateLimit + truncatedTextToUse.length,
                       ) + truncatedTextToUse
                     : logMessage.slice(0, truncateLimit)
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABL_TRUN…' to be '\'{"stack"_TRUNCATED_' // Object.is equality

[Killed] MethodExpression
src/index.ts:232:23
                           0,
                           truncateLimit - truncatedTextToUse.length,
                       ) + truncatedTextToUse
-                    : logMessage.slice(0, truncateLimit)
+                    : logMessage
         }
 
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 2
statusReason: expected '\'{"stack":"Error: 14 UNAVAILABLE: No…' to be '\'{' // Object.is equality

[Killed] ObjectLiteral
src/index.ts:235:16
                     : logMessage.slice(0, truncateLimit)
         }
 
-        return {
-            level: loglevel,
-            logger: loggerName,
-            message: logMessage,
-            serviceName: serviceName,
-            timestamp: new Date().toISOString(),
-        }
+        return {}
     }
 
killedBy: expects a correct logEntry is created for given undefined , undefined and 'VERBOSE'
statusReason: expected undefined to be 'undefined. Log arguments are: undefin…' // Object.is equality

[Killed] BlockStatement
src/index.ts:250:44
      * @param {message} string - The original message
      * @returns {string} the formatted message
      */
-    formatMessage(message: string): string {
-        if (
-            message &&
-            (message.indexOf('{') === 0 || message.indexOf('[') === 0)
-        ) {
-            return `'${message}'`
-        }
-        return message
-    }
+    formatMessage(message: string): string {}
 
     /**
killedBy: expects a correct logEntry is created for given 'I am a log message!' , undefined and 'INFO'
statusReason: expected 'undefined. Log arguments are: undefin…' to be 'I am a log message!. Log arguments ar…' // Object.is equality

[Killed] LogicalOperator
src/index.ts:252:13
      */
     formatMessage(message: string): string {
         if (
-            message &&
-            (message.indexOf('{') === 0 || message.indexOf('[') === 0)
+            message || message.indexOf('{') === 0 || message.indexOf('[') === 0
         ) {
             return `'${message}'`
killedBy: expects a correct logEntry is created for given undefined , undefined and 'VERBOSE'
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] ConditionalExpression
src/index.ts:252:13
      */
     formatMessage(message: string): string {
         if (
-            message &&
-            (message.indexOf('{') === 0 || message.indexOf('[') === 0)
+            false
         ) {
             return `'${message}'`
killedBy: expects a correct logEntry is created for given '{context: {info:"something"}}' , undefined and 'INFO'
statusReason: expected '{context: {info:"something"}}. Log ar…' to be '\'{context: {info:"something"}}\'. Lo…' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:253:14
     formatMessage(message: string): string {
         if (
             message &&
-            (message.indexOf('{') === 0 || message.indexOf('[') === 0)
+            (false || message.indexOf('[') === 0)
         ) {
             return `'${message}'`
killedBy: expects a correct logEntry is created for given '{context: {info:"something"}}' , undefined and 'INFO'
statusReason: expected '{context: {info:"something"}}. Log ar…' to be '\'{context: {info:"something"}}\'. Lo…' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:253:44
     formatMessage(message: string): string {
         if (
             message &&
-            (message.indexOf('{') === 0 || message.indexOf('[') === 0)
+            (message.indexOf('{') === 0 || false)
         ) {
             return `'${message}'`
killedBy: expects a correct logEntry is created for given '["one", "two"]' , undefined and 'INFO'
statusReason: expected '["one", "two"]. Log arguments are: un…' to be '\'["one", "two"]\'. Log arguments are…' // Object.is equality

[Killed] BlockStatement
src/index.ts:254:11
         if (
             message &&
             (message.indexOf('{') === 0 || message.indexOf('[') === 0)
-        ) {
-            return `'${message}'`
-        }
+        ) {}
         return message
     }
killedBy: expects a correct logEntry is created for given '{context: {info:"something"}}' , undefined and 'INFO'
statusReason: expected '{context: {info:"something"}}. Log ar…' to be '\'{context: {info:"something"}}\'. Lo…' // Object.is equality

[Killed] BlockStatement
src/index.ts:266:47
      * @param {message} string - The original message
      * @returns {boolean} true if the message contains a Timeout information
      */
-    containsTimeout(message: string): boolean {
-        return (
-            message.includes('4 DEADLINE_EXCEEDED') ||
-            message.includes('14 UNAVAILABLE') ||
-            message.includes('ECONNREFUSED') ||
-            message.includes('EPERM') ||
-            message.includes('Timeout')
-        )
-    }
+    containsTimeout(message: string): boolean {}
 
     /**
killedBy: Logger writes expected output to command line Test Timeout error message logging for message containing "14 UNAVAILABLE"
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] LogicalOperator
src/index.ts:268:13
      */
     containsTimeout(message: string): boolean {
         return (
-            message.includes('4 DEADLINE_EXCEEDED') ||
-            message.includes('14 UNAVAILABLE') ||
-            message.includes('ECONNREFUSED') ||
-            message.includes('EPERM') ||
-            message.includes('Timeout')
+            (message.includes('4 DEADLINE_EXCEEDED') || message.includes('14 UNAVAILABLE') || message.includes('ECONNREFUSED') || message.includes('EPERM')) && message.includes('Timeout')
         )
     }
killedBy: Logger writes expected output to command line Test Timeout error message logging for message containing "14 UNAVAILABLE"
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] LogicalOperator
src/index.ts:268:13
      */
     containsTimeout(message: string): boolean {
         return (
-            message.includes('4 DEADLINE_EXCEEDED') ||
-            message.includes('14 UNAVAILABLE') ||
-            message.includes('ECONNREFUSED') ||
+            (message.includes('4 DEADLINE_EXCEEDED') || message.includes('14 UNAVAILABLE')) && message.includes('ECONNREFUSED') ||
             message.includes('EPERM') ||
             message.includes('Timeout')
killedBy: Logger writes expected output to command line Test Timeout error message logging for message containing "14 UNAVAILABLE"
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]

[Killed] StringLiteral
src/index.ts:271:30
             message.includes('4 DEADLINE_EXCEEDED') ||
             message.includes('14 UNAVAILABLE') ||
             message.includes('ECONNREFUSED') ||
-            message.includes('EPERM') ||
+            message.includes("") ||
             message.includes('Timeout')
         )
killedBy: Logger writes expected output to command line Test Timeout error message logging for message containing "14 UNAVAILABLE"
statusReason: expected 3rd "log" call to have been called with [ Array(1) ]

[Killed] BlockStatement
src/index.ts:282:65
      * @param {unknown[]} arguments_ - The log arguments
      * @returns {boolean} true if the message arguments are part of an incomingRequest message
      */
-    isIncomingRequestLogMessage(arguments_: unknown[]): boolean {
-        return (
-            typeof arguments_[0] === 'string' &&
-            arguments_[0].includes('incomingRequest')
-        )
-    }
+    isIncomingRequestLogMessage(arguments_: unknown[]): boolean {}
 
     /**
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] ConditionalExpression
src/index.ts:284:13
      */
     isIncomingRequestLogMessage(arguments_: unknown[]): boolean {
         return (
-            typeof arguments_[0] === 'string' &&
-            arguments_[0].includes('incomingRequest')
+            false
         )
     }
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] EqualityOperator
src/index.ts:284:13
      */
     isIncomingRequestLogMessage(arguments_: unknown[]): boolean {
         return (
-            typeof arguments_[0] === 'string' &&
+            typeof arguments_[0] !== 'string' &&
             arguments_[0].includes('incomingRequest')
         )
killedBy: Logger writes expected output to command line Test logging only first incoming message and no other debug messages
statusReason: arguments_[0].includes is not a function

[Killed] BlockStatement
src/index.ts:294:61
      * @param {LogLevel} logLevel - The log level to check
      * @returns {boolean} true if the log level is equal or higher than the minimum log level
      */
-    isEqualOrHigherMinLogLevel(logLevel: LogLevel): boolean {
-        const { minLogLevel } = this.loggerOptions
-        return (
-            logLevelByScope.indexOf(logLevel) >=
-            logLevelByScope.indexOf(minLogLevel)
-        )
-    }
+    isEqualOrHigherMinLogLevel(logLevel: LogLevel): boolean {}
 
     /**
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] ConditionalExpression
src/index.ts:297:13
     isEqualOrHigherMinLogLevel(logLevel: LogLevel): boolean {
         const { minLogLevel } = this.loggerOptions
         return (
-            logLevelByScope.indexOf(logLevel) >=
-            logLevelByScope.indexOf(minLogLevel)
+            false
         )
     }
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] EqualityOperator
src/index.ts:297:13
     isEqualOrHigherMinLogLevel(logLevel: LogLevel): boolean {
         const { minLogLevel } = this.loggerOptions
         return (
-            logLevelByScope.indexOf(logLevel) >=
-            logLevelByScope.indexOf(minLogLevel)
+            logLevelByScope.indexOf(logLevel) < logLevelByScope.indexOf(minLogLevel)
         )
     }
killedBy: Logger writes expected output to command line Test DiagLogger interface functions
statusReason: expected 1st "log" call to have been called with [ Array(1) ], but called only 0 times

[Killed] BlockStatement
src/index.ts:308:59
      * @param {message} string - The original message
      * @returns {boolean} true if the message contains an async attribute error
      */
-    containsAsyncAttributeError(message: string): boolean {
-        return message.includes('before async attributes settled')
-    }
+    containsAsyncAttributeError(message: string): boolean {}
 }
 
killedBy: Logger writes expected output to command line Test async attribute error message logging
statusReason: expected 2nd "log" call to have been called with [ Array(1) ]
